[
  {
    "id": "recipe-1620000000000",
    "name": "Teriyaki Chicken Stir Fry",
    "url": "https://littlesunnykitchen.com/teriyaki-chicken-stir-fry/",
    "prepTime": "15 mins",
    "cookTime": "10 mins",
    "servings": "4",
    "ingredients": [
      "1 pound boneless skinless chicken breasts or thighs, cut into 1-inch pieces",
      "1 tablespoon cornstarch",
      "2 tablespoons olive oil or sesame oil, divided",
      "1 red bell pepper, sliced",
      "1 green bell pepper, sliced",
      "1 yellow bell pepper, sliced",
      "1 broccoli head, cut into florets (about 2 cups)",
      "4 cloves garlic, minced",
      "1 inch ginger, grated",
      "1/2 cup teriyaki sauce, homemade or store-bought",
      "Cooked rice, for serving",
      "Sesame seeds and sliced green onions, for garnish"
    ],
    "instructions": "1. In a bowl, toss chicken pieces with cornstarch until well coated.\n2. Heat 1 tablespoon of oil in a large skillet or wok over medium-high heat. Add chicken and cook for 5-7 minutes or until browned and cooked through. Remove chicken from the skillet and set aside.\n3. Add remaining tablespoon of oil to the skillet. Add bell peppers and broccoli florets, cook for 3-4 minutes until tender-crisp.\n4. Add garlic and ginger, cook for 30 seconds until fragrant.\n5. Return chicken to the skillet. Pour in teriyaki sauce and stir everything together. Bring to a simmer and cook for 1-2 minutes, or until the sauce has thickened slightly and coats the chicken and vegetables.\n6. Serve immediately over cooked rice, garnished with sesame seeds and sliced green onions if desired.",
    "imageUrl": "https://littlesunnykitchen.com/wp-content/uploads/2020/04/Teriyaki-Chicken-Stir-fry-Recipe-1.jpg",
    "notes": "Can add other vegetables like carrots or snap peas."
  },
  {
    "id": "recipe-1747554545363",
    "url": "https://littlesunnykitchen.com/marry-me-chicken/",
    "name": "Marry Me Chicken",
    "prepTime": "N/A",
    "cookTime": "N/A",
    "servings": "N/A",
    "ingredients": [
      "3 large chicken breasts",
      "½ teaspoon salt",
      "¼ teaspoon ground black pepper",
      "6 tablespoons all-purpose flour",
      "2 tablespoons olive oil",
      "2 tablespoons unsalted butter",
      "3 cloves garlic",
      "1 cup chicken stock",
      "1 cup heavy cream",
      "½ cup parmesan cheese",
      "1 teaspoon chili flakes",
      "¼ teaspoon oregano",
      "¼ teaspoon thyme",
      "⅓ cup sundried tomatoes",
      "1 tablespoon fresh basil leaves"
    ],
    "instructions": "1. Season chicken with salt and pepper, then dredge in flour and shake off any excess.\n2. In a large skillet, heat olive oil and melt the butter on medium heat. Swirl pan to coat with oil and butter evenly.\n3. Brown the chicken (do not overcrowd and work in batches if needed) for 4-5 minutes on each side or until golden brown and cooked through. Transfer onto a plate, cover, and set aside.\n4. Saute the garlic for a minute or until it's fragrant. Add the chicken stock, and deglaze the pan scraping any bits stuck to the bottom of the pan with a wooden spoon.\n5. Adjust the heat to medium-low, and add the heavy cream and the parmesan cheese to the skillet. Allow the sauce to simmer for a couple of minutes, then season with chili flakes, thyme, and oregano.\n6. Season with salt and pepper to your taste, add the sundried tomatoes then put the chicken back in the sauce and let the sauce simmer and thicken for a few more minutes.\n7. Garnish with chopped fresh basil leaves and serve warm over pasta or rice.",
    "imageUrl": "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20750%20750'%3E%3C/svg%3E",
    "notes": ""
  }
]